ERM/src/DataProcessors/ОбновлениеСтатусаInvoiceNotDue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеСтатусаInvoiceNotDue</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/InvoiceComments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>InvoiceComments</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InvoiceStatus</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьConfirmedBy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьComment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьForecastDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьCustInputDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьCustomerRepresentative</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьCustomerInputDetails</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьSLBAssignedTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьRemedialWorkPlan</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьRWDTargetDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Problem</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InvoiceProblem</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Inactive</Name>
					<Comment>Признак неактуального комментария</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/InvoiceStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>InvoiceStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CustomerIsInsolventOrBankrupt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingSLBDocumentation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Pricing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TechnicalSQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LostInHole</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingInvoiceApproval</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PendingPaymentAllocation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientConfirmedPayment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoicePaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EscalatedToSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoiceNotDue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerIsUnavailable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientHasLiquidityProblems</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/DataProcessors/ОбновлениеСтатусаInvoiceNotDue/ManagerModule.bsl
&НаСервере
Процедура ЗаполнитьСтатусInvoiceNotDue() Экспорт 
	
	//Если ДатаОстатков = '00010101' Тогда
	//	ДатаОстатков = НачалоДня(ТекущаяДата());
	//КонецЕсли;
	//
	//Если ДатаКомментария = '00010101' Тогда
	//	ДатаКомментария = НачалоДня(ТекущаяДата());
	//КонецЕсли;
	
	Дата = НачалоДня(ТекущаяДата());
	Дата1980 = '19800101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	BilledARОстатки.Invoice
		|ИЗ
		|	РегистрНакопления.BilledAR.Остатки(&Дата, ) КАК BilledARОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.InvoiceComments КАК InvoiceComments
		|		ПО BilledARОстатки.Invoice = InvoiceComments.Invoice
		|ГДЕ
		|	InvoiceComments.Invoice ЕСТЬ NULL 
		|	И BilledARОстатки.Invoice.DueDateTo > &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	BilledARОстатки.Invoice КАК Invoice,
		|	BilledARОстатки.Invoice.DueDateTo КАК DueDateTo
		|ИЗ
		|	РегистрНакопления.BilledAR.Остатки(&Дата, ) КАК BilledARОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.InvoiceComments.СрезПоследних(, ) КАК InvoiceCommentsСрезПоследних
		|		ПО BilledARОстатки.Invoice = InvoiceCommentsСрезПоследних.Invoice
		|ГДЕ
		|	BilledARОстатки.Invoice.DueDateTo <= &Дата
		|	И BilledARОстатки.Invoice.DueDateTo <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И InvoiceCommentsСрезПоследних.Problem.Status = ЗНАЧЕНИЕ(перечисление.InvoiceStatus.InvoiceNotDue)";
	
	//Запрос.УстановитьПараметр("Дата", ДатаОстатков);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	//РезультатЗапроса = Запрос.Выполнить();
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	User = ПараметрыСеанса.ТекущийПользователь;
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаУстановитьСтатус = МассивРезультатов[0].Выбрать();
	ВыборкаУстановитьПустойСтатус = МассивРезультатов[1].Выбрать();
	
	НаборЗаписей = РегистрыСведений.InvoiceComments.СоздатьНаборЗаписей();
	
	Пока ВыборкаУстановитьСтатус.Следующий() Цикл
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Invoice.Установить(ВыборкаУстановитьСтатус.Invoice);
		
		СтруктураРеквизитовПроблемы = Новый Структура("Дата, Invoice, User, Status, ConfirmedBy, CustomerRepresentative, CustomerInputDetails, Comment, CustInputDate, ForecastDate, RemedialWorkPlan, RWDTargetDate, SLBAssignedTo");
		СтруктураРеквизитовПроблемы.Дата = Дата1980;
		СтруктураРеквизитовПроблемы.Invoice = ВыборкаУстановитьСтатус.Invoice;
		СтруктураРеквизитовПроблемы.Status = Перечисления.InvoiceStatus.InvoiceNotDue;
		СтруктураРеквизитовПроблемы.User = User;
		СтруктураРеквизитовПроблемы.Comment = "Регламент по актуализации статуса Invoice Not Due.";
		
		НачатьТранзакцию();
		
		Problem = РегистрыСведений.InvoiceComments.СоздатьInvoiceProblem(СтруктураРеквизитовПроблемы);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата1980;
		НоваяЗапись.Invoice = ВыборкаУстановитьСтатус.Invoice;
		//НоваяЗапись.Status = Перечисления.InvoiceStatus.InvoiceNotDue;
		//НоваяЗапись.User = User;
		НоваяЗапись.Problem = Problem;
		НаборЗаписей.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	Пока ВыборкаУстановитьПустойСтатус.Следующий() Цикл
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Invoice.Установить(ВыборкаУстановитьПустойСтатус.Invoice);
		
		СтруктураРеквизитовПроблемы = Новый Структура("Дата, Invoice, User, Status, ConfirmedBy, CustomerRepresentative, CustomerInputDetails, Comment, CustInputDate, ForecastDate, RemedialWorkPlan, RWDTargetDate, SLBAssignedTo");
		СтруктураРеквизитовПроблемы.Дата = ВыборкаУстановитьПустойСтатус.DueDateTo;
		СтруктураРеквизитовПроблемы.Invoice = ВыборкаУстановитьПустойСтатус.Invoice;
		СтруктураРеквизитовПроблемы.Status = Перечисления.InvoiceStatus.ПустаяСсылка();
		СтруктураРеквизитовПроблемы.User = User;
		СтруктураРеквизитовПроблемы.Comment = "Регламент по актуализации статуса Invoice Not Due.";
		
		НачатьТранзакцию();
		
		Problem = РегистрыСведений.InvoiceComments.СоздатьInvoiceProblem(СтруктураРеквизитовПроблемы);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ВыборкаУстановитьПустойСтатус.DueDateTo;
		НоваяЗапись.Invoice = ВыборкаУстановитьПустойСтатус.Invoice;
		//НоваяЗапись.Status = Перечисления.InvoiceStatus.InvoiceNotDue;
		//НоваяЗапись.User = User;
		НоваяЗапись.Problem = Problem;
		НаборЗаписей.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
КонецПроцедуры
